Revit 2026 API

# BuiltInFailuresSheetCollectionFailures Class

---

Failures about SheetCollection.

SystemObject Autodesk.Revit.DBBuiltInFailuresSheetCollectionFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SheetCollectionFailures
```
```vb
Public NotInheritable Class SheetCollectionFailures
```
```cpp
public ref class SheetCollectionFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SheetCollectionFailures = class end
```

The BuiltInFailuresSheetCollectionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SheetCollectionDuplicateName | Sheet Collection name is already in use. Provide a unique name. |

#### Reference

Autodesk.Revit.DB Namespace